[
  {
    "id": "alex-okrushko",
    "duration": "30 min",
    "description": "<p>The responsiveness of the apps is one of the critical factors of how the users perceive them. Some of the sources of slowness are waiting for API responses and unhandled errors when they fail.</p> <p>NgRx is the state management solution, and because of the way it is designed, it can help to improve User Experience in many such areas. In particular, I’ll talk about: error handling, store as a cache, and optimistic updates.</p>",
    "title": "5 Tips to Improve User Experience with NgRx",
    "speakers": ["alex-okrushko"]
  },
  {
    "id": "mashhood-rastgar",
    "duration": "30 min",
    "description": "As Single Page Applications take over the world, we are introduced with yet another complexity: their size. Over time we have created patterns to manage complexity on our backends, one of the popular ones being microservices. This pattern is now being adopted by frontends under the name of micro-frontends.  In this talk I will introduce the concept and dive into how does one get about implementing a micro-frontend architecture for their project.",
    "title": "Scaling Frontend Development using Micro-frontends",
    "speakers": ["mashhood-rastgar"]
  },
  {
    "id": "jia-li",
    "duration": "30 min",
    "description": "<p>State Management is very important in Angular development, ngrx is one of the most used libraries. By using ngrx, there are a lot of advantages in development/test, but we also need to pay the learning cost for several new concepts (Store/Selector/Effect/Action/...), we also need to write a lot of boilerplate code for those extra layers. </p> <p> In this talk, we will use sample application to introduce how to use<br> 1. ngrx <br> 2. ngrx-enitty<br> 3. ngrx-data<br> to implement it, through that, I will introduce the mechanism of ngrx-entity and ngrx-data. I will also like to share my thought when I am using ngrx-data in practical project. </p>",
    "title": "From NgRx to NgRx-entity to NgRx-data",
    "speakers": ["jia-li"]
  },
  {
    "id": "sebastian-witalec",
    "duration": "30 min",
    "description": "<p>NativeScript is a free and open source JavaScript framework for building native iOS and Android apps. Add to that Angular with TypeScript and you will get a truly amazing combination. But I know what you’re thinking: another way of building apps? What makes NativeScript special? Here are a few cool things: </p> <p> · Direct access to native APIs—no plugins required. Want to create a file on Android? Run new java.io.File()—in JavaScript!<br> · Completely native performance through the use of a JavaScript bridge natively available on all three mobile platforms.<br> · Cross-platform libraries for common use cases. Need to call a JSON API? Run http.getJSON<br> · Style native apps using CSS. Yep, that’s actually a thing.<br> </p> <p> Curious about how it all works? Come learn! Architectures will be explained; apps will be built; and fun will be had by all. </p>",
    "title": "Building Mobile Apps with Angular and NativeScript",
    "speakers": ["sebastian-witalec"]
  },
  {
    "id": "tomas-trajan",
    "duration": "30 min",
    "description": "<p>In development, we often want to extract reusable parts of logic into self contained libraries. Modern tooling provided by Angular CLI enables us to provide amazing developer experience for the users of our libraries. </p> <p> Libraries can be added seamlessly, while automating all the necessary setup work. </p> <p> More so, providing built-in library specific schematics enables us to cut on the learning curve that is needed to get developers productive straight from the start by generating code which follows intentioned patterns and best practices. </p> <p> In this talk, we're going to explore: <br> 1. What are Angular Schematics<br> 2. Why and how to use them<br> 3. Best practices and tips for using default Angular schematics<br> 4. How to build simple schematics for our custom library<br> 5. How to make our library \"ng add\" - able to make it seamless for the consumers<br> </p>",
    "title": "Leverage Angular Schematics to empower developers of Frontend App & libraries",
    "speakers": ["tomas-trajan"]
  },
  {
    "id": "how-we-build-ng-my-website",
    "duration": "30 min",
    "description": "<p>In this talk, we will share about some techniques we apply in building NG-MY website, so you can easily apply these techniques in your website too! Here is what we will cover: </p> <p> - Making Angular website performant & SEO friendly<br> - Customize Angular CLI Build prerender website<br> - Apply Animation to make your site cooler<br> - Modern CSS with CSS Variables<br> - Feature Flagging & Continuous Integration / Deployment (CI/CD)<br> </p>",
    "title": "How We Build NG-MY Website: Performance, SEO, Customized CLI Build, Animation, Modern CSS",
    "speakers": ["jecelyn-yeen"]
  },
  {
    "id": "jerry-kurata",
    "duration": "30 min",
    "description": "<p>You have no doubt heard about the wonders of Machine Learning. Thanks to Machine Learning we now have algorithms that let programs detect objects in images, translate text and speech from one language to another, make recommendations of products someone might purchase, and detect diseases from a person’s picture.</p><p>These capabilities have previously been the realm of Data Scientists working with rooms full of hardware.  But now this power is available to us to use in our Angular applications.</p><p>In this talk you will learn how Machine Learning works, and how we can use machine learning in our code to enhance the capabilities of our applications.</p>",
    "title": "Machine Learning and AI for Angular Developers",
    "speakers": ["jerry-kurata"]
  },
  {
    "id": "kevin-yang",
    "duration": "30 min",
    "description": "<p>Functional reactive programming has been around for many years. There are so many reasons make people keep talking about it.</p><p>In this talk, we are going to talk about<br>1. What is functional reactive programming good at?<br>2. Why should you care about it and adopt it?<br>3. How can we use it with RxJS in Angular?<br>4. How about Ramda?</p>",
    "title": "Why should you care about functional reactive programming?",
    "speakers": ["kevin-yang"]
  },
  {
    "id": "mike-ryan",
    "duration": "30 min",
    "description": "<p>One of the biggest challenges building out large Angular applications is the management of complexity, but where does this complexity come from? Both state management and control flow are some of the largest contributors to unwieldy, hard-to-maintain code. Learn how the design of NgRx helps you manage this complexity by exploring the architectural underpinnings of functional, reactive Angular applications.</p>",
    "title": "Complexity Management with NgRx",
    "speakers": ["mike-ryan"]
  },
  {
    "id": "kamil-mysliwiec",
    "duration": "30 min",
    "description": "<p>Dependency Injection framework is a core and inherent feature of both Nest and Angular. DI simplifies creating scalable, testable, and maintainable applications by giving us flexible and efficient abstractions. However, did we ever think how this mechanism works underneath? In this talk, we’ll compare how Nest and Angular DI systems differ from each other as well as dive into the basics of the metadata reflection API in TypeScript.</p>",
    "title": "Beyond TypeScript Metadata: Dependency Injection in Angular and Nest",
    "speakers": ["kamil-mysliwiec"]
  },
  {
    "id": "deborah-kurata",
    "duration": "30 min",
    "description": "<p>RxJS is one of those technologies we use every day, but there is always a bit more to learn. In this session, we focus on specific use cases:</p><p>- Collecting data from a backend server<br/>- Combining data streams with other data streams to handle foreign key and aggregate relationships<br/>- Caching the streams in a service so they can be readily reused<br/>- And producing user-friendly data for display<br/>- All without a single subscription</p><p>Join me for this talk as we get to know another side of RxJS.</p>",
    "title": "Collect, Combine, and Cache RxJS Streams for User-Friendly Results... Without a Subscription",
    "speakers": ["deborah-kurata"]
  },
  {
    "id": "gerard-sans",
    "duration": "30 min",
    "description": "<p>What is exactly Ivy Renderer? What features will affect the way we build apps? How can we benefit for this technology? In this presentation I will cover these and other fundamental questions while demonstrating all the features available today!</p>",
    "title": "Ivy Renderer for Dummies",
    "speakers": ["gerard-sans"]
  },
  {
    "id": "kamil-kisiela",
    "duration": "30 min",
    "description": "<p>After a very short introduction about GraphQL, we’re going to dive deep into how it’s being used today and what me and The Guild have learnt from all those years of having GraphQL as a main part of our stack. We will also rethink current most used solutions and see how they compare to GraphQL.</p>",
    "title": "GraphQL at Any Level of Your Stack",
    "speakers": ["kamil-kisiela"]
  },
  {
    "id": "jennifer-shehane",
    "duration": "30 min",
    "description": "<p>End-to-end tests are a crucial part of the testing pyramid, yet they are often overlooked entirely. They are notorious for being hard to set up, flaky when they run, and slow to debug.</p><p>Why is running end-to-end tests so unreliable? Is there a way to write useful end-to-end tests quickly without the hair-pulling frustration?</p><p>In this talk, we'll delve into Cypress.io - a new, refreshing approach to testing web applications. We’ll examine Cypress’ anatomy and show what makes it a better fit for testing modern, Angular web applications. Using this new tool, your tests can react to your application’s events in real time, read or alter web traffic on the fly, and programmatically interact and control your application while testing. You will walk away with the means to have your tests reliably run and quickly execute, giving you the ability to test your applications while you develop for the first time.</p>",
    "title": "Automated Testing for the Modern Web",
    "speakers": ["jennifer-shehane"]
  },
  {
    "id": "amadou-sall",
    "duration": "30 min",
    "description": "<p>Angular Material AND Bootstrap for your next Angular application? It doesn't make sense, does it? The first time I talked to my colleagues about combining the two, they laughed at me. But now, they love the approach because it works like a charm.</p><p>In this session, we will see how we can leverage the best parts of both libraries to build beautiful, maintainable, and responsive Angular applications with very little CSS.</p>",
    "title": "Angular Material or Bootstrap? Stop asking the question!",
    "speakers": ["amadou-sall"]
  },
  {
    "id": "tom-suijkerbuijk-mart-ganzevles",
    "duration": "30 min",
    "description": "<p>On the BlueWeb project, which is a project to completely rewrite the B2C web applications of Air France  and  KLM, we have been using Angular since the early days. We started our project on Angular 2.0.0-rc.2. We are using this in combination with GraphQL on the server side, quite an interesting setup. Since AirFrance-KLM is one of the biggest airlines groups in the world, it is quite an important and big platform for the company.</p><p>There’s multiple ways to split a big Angular project, we’ve tried multiple different solutions within Air France KLM and over the years the project has changed and evolved in the set-up.<br />- Single App (single repo)<br />- Micro Front End Architecture (multi repo)<br />- Monorepo</p><p>With our story we want to show you what we have learned and show the multiple options there are and what to consider when building a large scale Angular app and not to make the same mistakes as we have made.</p><p>In a talk we gave at GraphQL Summit San Francisco in 2017 you can see where we started (https://www.youtube.com/watch?v=T2njjXHdKqw). Also we recently shared a blogpost on medium on how we deal with upgrades in Angular. This blogpost was shared by all the big Angular contributers and also mentioned by Brad Green during NgAtlanta. You can read the post here: https://medium.com/airfrance-klm/how-we-upgraded-a-website-with-half-a-billion-annual-users-to-angular-7-in-less-then-a-day-71de33a1108e</p><p>As you can see we can’t stretch enough on how important it is to stay with the latest Angular release. And also why it doesn’t have to be scary for big companies to work with these new technologies and how it enables you to roll out a new version of your application on a daily basis as long as your mindset and set-up is correct. We can talk about why companies should be releasing smaller chunks but more regularly and how to get there:<br />- Branching strategies<br />- Automated Testing<br />- Mobile Device Testing</p>",
    "title": "Large Scale Angular Applications",
    "speakers": ["tom-suijkerbuijk", "mart-ganzevles"]
  }
]
